In [3]:
import pandas as pd
import numpy as np

In [4]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [7]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
havaDurumuDataFrame.dropna(axis = 0)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [10]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [14]:
yeniVeri = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38], "Antalya" : [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [12]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [19]:
yeniDataFrame.dropna(axis = 1, thresh = 2 )

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [22]:
yeniDataFrame.dropna(axis = 0, thresh = 2 )

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [23]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## Groupby

In [31]:
maasSozlugu = {"Departman" : ["Yazilim","Yazilim","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Calisanlar" : ["Ahmet","Mehmet","Ozge","Atil","Burak","Zeynep"],
              "Maas" : [100,150,200,300,400,500] 
              }
maasDataFrame = pd.DataFrame(maasSozlugu)

In [32]:
maasDataFrame

   Departman Calisanlar  Maas
0    Yazilim      Ahmet   100
1    Yazilim     Mehmet   150
2  Pazarlama       Ozge   200
3  Pazarlama       Atil   300
4      Hukuk      Burak   400
5      Hukuk     Zeynep   500

In [48]:
grupObjesi = maasDataFrame.groupby("Departman")

In [45]:
grupObjesi.count()

           Calisanlar  Maas
Departman
Hukuk               2     2
Pazarlama           2     2
Yazilim             2     2

In [47]:
grupObjesi = maasDataFrame.groupby("Departman")["Maas"]
print(grupObjesi.mean())

Departman
Hukuk        450.0
Pazarlama    250.0
Yazilim      125.0
Name: Maas, dtype: float64

In [49]:
grupObjesi.min()

          Calisanlar  Maas
Departman
Hukuk          Burak   400
Pazarlama       Atil   200
Yazilim        Ahmet   100

In [52]:
grupObjesi.max()

          Calisanlar  Maas
Departman
Hukuk         Zeynep   500
Pazarlama       Ozge   300
Yazilim       Mehmet   150

In [53]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazilim     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [12]:
sozluk1 = {"Isim" : ["Ahmet", "Mehmet" , "Zeynep" , "Atil"],
           "Spor" : ["Kosu", "Yuzme", "Kosu","Basketbol"],
           "Kalori" : [100,200,300,400]
          }

In [13]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [14]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atil  Basketbol     400

In [15]:
sozluk2 = {"Isim" : ["Osman", "Levent" , "Atlas" , "Fatma"],
           "Spor" : ["Kosu", "Yuzme", "Kosu","Basketbol"],
           "Kalori" : [300,356,339,480]
          }

In [16]:
dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [17]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Kosu     300
5  Levent      Yuzme     356
6   Atlas       Kosu     339
7   Fatma  Basketbol     480

In [19]:
sozluk3 = {"Isim" : ["Ayse", "Mahmut" , "Duygu" , "Nur"],
           "Spor" : ["Kosu", "Yuzme", "Kosu","Basketbol"],
           "Kalori" : [473,466,382,947]
          }

In [26]:
dataFrame3 = pd.DataFrame(sozluk3,index = [8,9,10,11])

In [27]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Kosu     473
9   Mahmut      Yuzme     466
10   Duygu       Kosu     382
11     Nur  Basketbol     947

### Concatenation

In [34]:
pd.concat([dataFrame1,dataFrame2,dataFrame3] , axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       Kosu     300
3     Atil  Basketbol     400
4    Osman       Kosu     300
5   Levent      Yuzme     356
6    Atlas       Kosu     339
7    Fatma  Basketbol     480
8     Ayse       Kosu     473
9   Mahmut      Yuzme     466
10   Duygu       Kosu     382
11     Nur  Basketbol     947

In [35]:
pd.concat([dataFrame1,dataFrame2,dataFrame3] , axis = 1)

,Isim,Spor,Kalori,Isim,Spor,Kalori,Isim,Spor,Kalori
0,Ahmet,Kosu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,Yuzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Zeynep,Kosu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Atil,Basketbol,400.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Osman,Kosu,300.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Levent,Yuzme,356.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Atlas,Kosu,339.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Fatma,Basketbol,480.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ayse,Kosu,473.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mahmut,Yuzme,466.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Duygu,Kosu,382.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Nur,Basketbol,947.0

### Merge

In [43]:
mergeSozluk1 = {"Isim" : ["Ahmet", "Mehmet" , "Zeynep" , "Atil"],
                "Spor" : ["Kosu", "Yuzme", "Kosu", "Basketbol"]
               }

In [44]:
merDataFrame1 = pd.DataFrame(mergeSozluk1)

In [45]:
merDataFrame1

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yuzme
2  Zeynep       Kosu
3    Atil  Basketbol

In [46]:
mergeSozluk2 = {"Isim" : ["Ahmet", "Mehmet" , "Zeynep" , "Atil"],
                "Kalori" : [100,200,233,543]
               }

In [47]:
merDataFrame2 = pd.DataFrame(mergeSozluk2)

In [48]:
merDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     233
3    Atil     543

In [50]:
pd.merge(merDataFrame1,merDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     233
3    Atil  Basketbol     543

In [6]:

maasSozluk = {"Isim" : ["Ozge", "Atil", "Zeynep", "Ahmet"],
              "Departman" : ["Yazilim", "Satis", "Pazarlama", "Yazilim"],
              "Maas" : [200,300,400,500]
             }

In [7]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [8]:
maasDataFrame

     Isim  Departman  Maas
0    Ozge    Yazilim   200
1    Atil      Satis   300
2  Zeynep  Pazarlama   400
3   Ahmet    Yazilim   500

In [9]:
maasDataFrame["Departman"]

0      Yazilim
1        Satis
2    Pazarlama
3      Yazilim
Name: Departman, dtype: object

In [11]:
maasDataFrame["Departman"].unique()

array(['Yazilim', 'Satis', 'Pazarlama'], dtype=object)

In [12]:
maasDataFrame["Departman"].nunique()

3

In [13]:
maasDataFrame["Departman"].value_counts()

Departman
Yazilim      2
Satis        1
Pazarlama    1
Name: count, dtype: int64

In [16]:
def bruttenNete(maas):
    return maas * 0.66

In [17]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [18]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [32]:
yeniBirVeri = {"Karakter Sinifi" : ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
               "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart","Bart"],
               "Karakter Yasi" : [9,10,50,20,24] 
              }

In [33]:
karakterDataFrame = pd.DataFrame(yeniBirVeri)

In [34]:
karakterDataFrame

  Karakter Sinifi Karakter Ismi  Karakter Yasi
0      South Park       Cartman              9
1      South Park         Kenny             10
2         Simpson         Homer             50
3         Simpson          Bart             20
4         Simpson          Bart             24

In [43]:
karakterDataFrame.pivot_table(values = "Karakter Yasi", index = ["Karakter Sinifi", "Karakter Ismi"], aggfunc =np.sum)

C:\Users\Ozge\AppData\Local\Temp\ipykernel_7736\4200857156.py:1: FutureWarning: The provided callable <function sum at 0x0000023B6BDA8EA0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karakterDataFrame.pivot_table(values = "Karakter Yasi", index = ["Karakter Sinifi", "Karakter Ismi"], aggfunc =np.sum)

                               Karakter Yasi
Karakter Sinifi Karakter Ismi
Simpson         Bart                      44
                Homer                     50
South Park      Cartman                    9
                Kenny                     10